### Import required dependencies

In [ ]:
import pandas as pd
import os

## Deliverable 1: Collect the Data

To collect the data that you’ll need, complete the following steps:

1. Using the Pandas `read_csv` function and the `os` module, import the data from the `new_full_student_data.csv` file, and create a DataFrame called student_df. 

2. Use the head function to confirm that Pandas properly imported the data.

In [ ]:
# Create the path and import the data
full_student_data = os.path.join('C:/Users/Administrator/Desktop/Bootcamp/Module_4/Resources/new_student_data.csv')
student_df = pd.read_csv(full_student_data)

In [100]:
# Verify that the data was properly imported

student_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type
0,127008367,Sarah Douglas,11th,Chang High School,87.2,64.1,Public
1,33365505,Francisco Osborne,9th,Fisher High School,NaN,NaN,Public
2,44359500,Ryan Haas,12th,Campbell High School,91.6,54.7,Public
3,24791243,Kathryn Mack,11th,Richard High School,68.9,73.3,Charter
4,121467881,Harold Reynolds,12th,Chang High School,68.7,43.4,Public

## Deliverable 2: Prepare the Data

To prepare and clean your data for analysis, complete the following steps:
    
1. Check for and remove all rows with `NaN`, or missing, values in the student DataFrame. 

2. Check for and remove all duplicate rows in the student DataFrame.

3. Use the `str.replace` function to remove the "th" from the grade levels in the grade column.

4. Check data types using the `dtypes` property.

5. Remove the "th" suffix from every value in the grade column using `str` and `replace`.

6. Change the grade colum to the `int` type and verify column types.

7. Use the head (and/or the tail) function to preview the DataFrame.

In [101]:
# Check for null values
student_df.isnull().sum()

student_id          0
student_name        0
grade               0
school_name         0
reading_score    1414
math_score        705
school_type         0
dtype: int64

In [103]:
# Drop rows with null values and verify removal

student_df = student_df.dropna()
student_df.isna().sum()

student_id       0
student_name     0
grade            0
school_name      0
reading_score    0
math_score       0
school_type      0
dtype: int64

In [104]:
# Check for duplicated rows
student_df.duplicated().sum()

1299

In [105]:
# Drop duplicated rows and verify removal
student_df =student_df.drop_duplicates()
student_df.duplicated().sum()

0

In [106]:
# Check data types
student_df.dtypes

student_id         int64
student_name      object
grade             object
school_name       object
reading_score    float64
math_score       float64
school_type       object
dtype: object

In [107]:
# Examine the grade column to understand why it is not an int
student_df['grade']

0        11th
2        12th
3        11th
4        12th
5         9th
         ...
13935    10th
13936    10th
13937     9th
13938    10th
13939    11th
Name: grade, Length: 10604, dtype: object

In [111]:
# Remove the non-numeric characters and verify the contents of the column
student_df['grade'].str.replace("th","")

0        11
2        12
3        11
4        12
5         9
         ..
13935    10
13936    10
13937     9
13938    10
13939    11
Name: grade, Length: 10604, dtype: object

In [110]:
# Change the grade column to the int type and verify column types
student_df['grade'].astype("int")

0        11
2        12
3        11
4        12
5         9
         ..
13935    10
13936    10
13937     9
13938    10
13939    11
Name: grade, Length: 10604, dtype: int32

## Deliverable 3: Summarize the Data

Describe the data using summary statistics on the data as a whole and on individual columns.

1. Generate the summary statistics for each DataFrame by using the `describe` function.

2. Display the mean math score using the `mean` function. 

2. Store the minimum reading score as `min_reading_score`.

In [112]:
# Display summary statistics for the DataFrame
student_df.describe()

         student_id  reading_score    math_score
count  1.060400e+04   10604.000000  10604.000000
mean   6.971953e+07      75.241513     64.343248
std    3.470851e+07      14.283955     16.662284
min    1.000132e+07       9.500000      1.400000
25%    3.974626e+07      65.900000     52.700000
50%    6.996368e+07      76.400000     65.000000
75%    9.984440e+07      86.300000     76.400000
max    1.299903e+08     100.000000    100.000000

In [143]:
# Display the mean math score using the mean function
student_df['math_score'].mean()

64.34324783100729

In [145]:
# Store the minimum reading score as min_reading_score
min_reading_score = student_df['reading_score'].min()
min_reading_score

9.5

## Deliverable 4: Drill Down into the Data

Drill down to specific rows, columns, and subsets of the data.

To drill down into the data, complete the following steps:

1. Use `loc` to display the grade column.

2. Use `iloc` to display the first 3 rows and columns 3, 4, and 5.

3. Show the rows for grade nine using `loc`.

4. Store the row with the minimum overall reading score as `min_reading_row` using `loc` and the `min_reading_score` found in Deliverable 3.

5. Find the reading scores for the school and grade from the output of step three using `loc` with multiple conditional statements.

6. Using conditional statements and `loc` or `iloc`, find the mean reading score for all students in grades 11 and 12 combined.

In [118]:
# Use loc to display the grade column
student_df.loc[:,['grade']]

      grade
0        11
2        12
3        11
4        12
5         9
...     ...
13935    10
13936    10
13937     9
13938    10
13939    11

[10604 rows x 1 columns]

In [119]:
# Use `iloc` to display the first 3 rows and columns 3, 4, and 5.
student_df.iloc[0:3, [3,4,5]]

            school_name  reading_score  math_score
0     Chang High School           87.2        64.1
2  Campbell High School           91.6        54.7
3   Richard High School           68.9        73.3

In [128]:
# Select the rows for grade nine and display their summary statistics using `loc` and `describe`.
grade_df = student_df.loc[student_df["grade"] == "9"]
grade_df.describe()

         student_id  reading_score   math_score
count  2.542000e+03    2542.000000  2542.000000
mean   7.021980e+07      77.796027    68.821676
std    3.482374e+07      13.149032    16.137150
min    1.002379e+07      19.900000    10.000000
25%    4.027663e+07      69.625000    58.625000
50%    7.013517e+07      79.100000    70.600000
75%    1.004694e+08      87.900000    80.475000
max    1.299257e+08     100.000000   100.000000

In [146]:
# Store the row with the minimum overall reading score as `min_reading_row`
# using `loc` and the `min_reading_score` found in Deliverable 3.
student_df['reading_score'].min()
min_reading_row = student_df.loc[student_df['reading_score']== min_reading_score]
min_reading_row

,student_id,student_name,grade,school_name,reading_score,math_score,school_type
3630,101306483,Colleen Chapman,10,Richard High School,9.5,46.7,Charter

In [230]:
# Use loc with conditionals to select all reading scores from 10th graders at Dixon High School.
reading_df = student_df["reading_score"]
student_df.loc[(student_df['school_name']=='Dixon High School')&(student_df['grade']=='10')][['reading_score','school_name']]

       reading_score        school_name
254             43.0  Dixon High School
655             38.7  Dixon High School
3396            67.9  Dixon High School
6626            61.4  Dixon High School
8837            54.1  Dixon High School
10262           78.4  Dixon High School
11607           70.5  Dixon High School
12526           82.9  Dixon High School
13772           85.7  Dixon High School

In [234]:
# Find the mean reading score for all students in grades 11 and 12 combined.

student_df.loc[(student_df['grade']=='11')|(student_df['grade']=='12')]['reading_score'].mean()

73.60980113636366

## Deliverable 5: Make Comparisons Between District and Charter Schools

Compare district vs charter schools for budget, size, and scores.

Make comparisons within your data by completing the following steps:

1. Using the `groupby` and `mean` functions, look at the average reading and math scores per school type.

1. Using the `groupby` and `count` functions, find the total number of students at each school.

2. Using the `groupby` and `mean` functions, find the average budget per grade for each school type.

In [180]:
# Use groupby and mean to find the average reading and math scores for each school type.

student_df.groupby("school_type").mean()

               student_id  reading_score  math_score
school_type
Charter      6.953366e+07      71.695539   61.649148
Public       6.974398e+07      75.708078   64.697727

In [ ]:
# Use the `groupby`, `count`, and `sort_values` functions to find the
# total number of students at each school and sort from most students to least students.

In [246]:
school_name = student_df.groupby("school_name").count()
school_name.sort_values(by=['student_id'],ascending=False)['student_id']

school_name
Turner High School        2120
Fisher High School        2085
Richard High School       1129
Chang High School          962
Campbell High School       941
Montgomery High School     671
Campos High School         540
Green High School          504
Bowers High School         418
Silva High School          411
Wagner High School         311
Sullivan High School       150
Odonnell High School       142
Woods High School          116
Dixon High School          104
Name: student_id, dtype: int64

# Deliverable 6: Summarize Your Findings
In the cell below, write a few sentences to describe any discoveries you made while performing your analysis along with any additional analysis you believe would be worthwhile.

I found it interesting that the reading and math score averages were about the same for the public and charter school.  I expected the charter schools to have higher scores.   I would like to see the average reading and math score broken out by school and then by grade.